app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2019-03-14 00:33:24.884372"], ["updated_at", "2019-03-14 00:33:24.884372"]]
---
  def create
    Post.create(params[:post])